zephyrproject-rtos/zephyr/drivers/adc/adc_mspm0_adc12.c
/*
 * Copyright (c) 2026 Texas Instruments
 * copyright (c) 2026 Linumiz
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#define DT_DRV_COMPAT ti_mspm0_adc12

#include <errno.h>

#define LOG_LEVEL CONFIG_ADC_LOG_LEVEL
#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(adc_mspm0);

#include <zephyr/device.h>
#include <zephyr/kernel.h>
#include <zephyr/init.h>
#include <zephyr/drivers/adc.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/regulator.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/dt-bindings/clock/mspm0_clock.h>
#include <zephyr/drivers/clock_control/mspm0_clock_control.h>

#define ADC_CONTEXT_USES_KERNEL_TIMER
#include "adc_context.h"

#define ADC_MSPM0_CHANNEL_MAX            (32)
#define ADC_MSPM0_NUM_SAMPLE_TIMERS      2
#define ADC_MSPM0_MAX_OVERSAMPLING       7
#define ADC_MSPM0_RESOLUTION_14          14
#define ADC_MSPM0_RESOLUTION_12          12
#define ADC_MSPM0_RESOLUTION_10          10
#define ADC_MSPM0_RESOLUTION_8           8
#define ADC_MSPM0_VREF_MULTIPLIER        1000
#define ADC_MSPM0_SCOMP0                 0
#define ADC_MSPM0_SCOMP1                 1
#define ADC_MSPM0_WAKEUP_TIME_NS         5000
#define ADC_MSPM0_NS_PER_SEC             1000000000
#define INT_VREF                         BIT(0)
#define EXT_VREF                         BIT(1)

/*
 * CPU_INT, GEN_EVENT and DMA_TRIG share this interrupt-controller register
 * layout; offsets below are relative to each block's own base address.
 */
struct adc_mspm0_int_regs {
	volatile const uint32_t iidx; /**< IIDX Interrupt index, offset: +0x00 */
	uint32_t reserved0;           /**< Reserved, offset: +0x04 - +0x08 */
	volatile uint32_t imask;      /**< IMASK Interrupt mask, offset: +0x08 */
	uint32_t reserved1;           /**< Reserved, offset: +0x0C - +0x10 */
	volatile const uint32_t ris;  /**< RIS Raw interrupt status, offset: +0x10 */
	uint32_t reserved2;           /**< Reserved, offset: +0x14 - +0x18 */
	volatile const uint32_t mis;  /**< MIS Masked interrupt status, offset: +0x18 */
	uint32_t reserved3;           /**< Reserved, offset: +0x1C - +0x20 */
	volatile uint32_t iset;       /**< ISET Interrupt set, offset: +0x20 */
	uint32_t reserved4;           /**< Reserved, offset: +0x24 - +0x28 */
	volatile uint32_t iclr;       /**< ICLR Interrupt clear, offset: +0x28 */
};

struct adc_mspm0_gprcm {
	volatile uint32_t pwren;      /**< PWREN Power enable, offset: 0x800 */
	volatile uint32_t rstctl;     /**< RSTCTL Reset Control, offset: 0x804 */
	volatile uint32_t clkcfg;     /**< CLKCFG ADC clock configuration Register, offset: 0x808 */
	uint32_t reserved[2];         /**< Reserved, offset: 0x80C - 0x814 */
	volatile const uint32_t stat; /**< STAT Status Register, offset: 0x814 */
};

/* ADC12 register map */
struct adc_mspm0_regs {
	uint32_t reserved0[256];  /**< Reserved, offset: 0x000 - 0x400 */
	volatile uint32_t fsub_0; /**< FSUB_0 Subscriber Configuration Register, offset: 0x400 */
	uint32_t reserved1[16];   /**< Reserved, offset: 0x404 - 0x444 */
	volatile uint32_t fpub_1; /**< FPUB_1 Publisher Configuration Register, offset: 0x444 */
	uint32_t reserved2[238];  /**< Reserved, offset: 0x448 - 0x800 */
	struct adc_mspm0_gprcm gprcm;        /**< Power/reset/clock control block, offset: 0x800 */
	uint32_t reserved3[514];             /**< Reserved, offset: 0x818 - 0x1020 */
	struct adc_mspm0_int_regs cpu_int;   /**< CPU interrupt block, offset: 0x1020 */
	uint32_t reserved4;                  /**< Reserved, offset: 0x104C - 0x1050 */
	struct adc_mspm0_int_regs gen_event; /**< General event interrupt block, offset: 0x1050 */
	uint32_t reserved5;                  /**< Reserved, offset: 0x107C - 0x1080 */
	struct adc_mspm0_int_regs dma_trig;  /**< DMA trigger interrupt block, offset: 0x1080 */
	uint32_t reserved6[13];              /**< Reserved, offset: 0x10AC - 0x10E0 */
	volatile const uint32_t evt_mode;    /**< EVT_MODE Event Mode, offset: 0x10E0 */
	uint32_t reserved7[6];               /**< Reserved, offset: 0x10E4 - 0x10FC */
	volatile const uint32_t desc;        /**< DESC Module Description, offset: 0x10FC */
	volatile uint32_t ctl0;              /**< CTL0 Control Register 0, offset: 0x1100 */
	volatile uint32_t ctl1;              /**< CTL1 Control Register 1, offset: 0x1104 */
	volatile uint32_t ctl2;              /**< CTL2 Control Register 2, offset: 0x1108 */
	uint32_t reserved8;                  /**< Reserved, offset: 0x110C - 0x1110 */
	volatile uint32_t clkfreq; /**< CLKFREQ Sample Clock Frequency Range, offset: 0x1110 */
	volatile uint32_t scomp0;  /**< SCOMP0 Sample Time Compare 0 Register, offset: 0x1114 */
	volatile uint32_t scomp1;  /**< SCOMP1 Sample Time Compare 1 Register, offset: 0x1118 */
	uint32_t reserved9[11];    /**< Reserved, offset: 0x111C - 0x1148 */
	volatile uint32_t wclow;   /**< WCLOW Window Comparator Low Threshold, offset: 0x1148 */
	uint32_t reserved10;       /**< Reserved, offset: 0x114C - 0x1150 */
	volatile uint32_t wchigh;  /**< WCHIGH Window Comparator High Threshold, offset: 0x1150 */
	uint32_t reserved11[3];    /**< Reserved, offset: 0x1154 - 0x1160 */
	volatile const uint32_t fifodata;   /**< FIFODATA FIFO Data Register, offset: 0x1160 */
	uint32_t reserved12[7];             /**< Reserved, offset: 0x1164 - 0x1180 */
	volatile uint32_t memctl[24];       /**< MEMCTL_y Memory Control, offset: 0x1180+0x04y */
	uint32_t reserved13[40];            /**< Reserved, offset: 0x11E0 - 0x1280 */
	volatile const uint32_t memres[24]; /**< MEMRES_y Memory Result, offset: 0x1280+0x04y */
	uint32_t reserved14[24];            /**< Reserved, offset: 0x12E0 - 0x1340 */
	volatile const uint32_t status;     /**< STATUS Status Register, offset: 0x1340 */
};

/* pwren bits */
#define ADC12_PWREN_ENABLE         BIT(0)
#define ADC12_PWREN_KEY            GENMASK(31, 24)
#define ADC12_PWREN_KEY_VAL_UNLOCK 0x26U

/* clkcfg bits */
#define ADC12_CLKCFG_SAMPCLK        GENMASK(1, 0)
#define ADC12_CLKCFG_KEY            GENMASK(31, 24)
#define ADC12_CLKCFG_KEY_VAL_UNLOCK 0xA9U

/* CLKCFG.SAMPCLK source select values (0 = ULPCLK, 1 = SYSOSC, 2 = HFCLK) */
#define ADC12_CLKCFG_SAMPCLK_VAL_ULPCLK FIELD_PREP(ADC12_CLKCFG_SAMPCLK, 0)
#define ADC12_CLKCFG_SAMPCLK_VAL_SYSOSC FIELD_PREP(ADC12_CLKCFG_SAMPCLK, 1)
#define ADC12_CLKCFG_SAMPCLK_VAL_HFCLK  FIELD_PREP(ADC12_CLKCFG_SAMPCLK, 2)

