zephyrproject-rtos/zephyr/drivers/adc/adc_mspm0_adc12.c
/* clkfreq bits */
#define ADC12_CLKFREQ_FRANGE                 GENMASK(2, 0)
#define ADC12_CLKFREQ_FRANGE_VAL_RANGE1TO4   FIELD_PREP(ADC12_CLKFREQ_FRANGE, 0)
#define ADC12_CLKFREQ_FRANGE_VAL_RANGE4TO8   FIELD_PREP(ADC12_CLKFREQ_FRANGE, 1)
#define ADC12_CLKFREQ_FRANGE_VAL_RANGE8TO16  FIELD_PREP(ADC12_CLKFREQ_FRANGE, 2)
#define ADC12_CLKFREQ_FRANGE_VAL_RANGE16TO20 FIELD_PREP(ADC12_CLKFREQ_FRANGE, 3)
#define ADC12_CLKFREQ_FRANGE_VAL_RANGE20TO24 FIELD_PREP(ADC12_CLKFREQ_FRANGE, 4)
#define ADC12_CLKFREQ_FRANGE_VAL_RANGE24TO32 FIELD_PREP(ADC12_CLKFREQ_FRANGE, 5)
#define ADC12_CLKFREQ_FRANGE_VAL_RANGE32TO40 FIELD_PREP(ADC12_CLKFREQ_FRANGE, 6)
#define ADC12_CLKFREQ_FRANGE_VAL_RANGE40TO48 FIELD_PREP(ADC12_CLKFREQ_FRANGE, 7)

/* ctl0 bits */
#define ADC12_CTL0_ENC              BIT(0)
#define ADC12_CTL0_PWRDN            BIT(16)
#define ADC12_CTL0_PWRDN_VAL_AUTO   0U
#define ADC12_CTL0_PWRDN_VAL_MANUAL ADC12_CTL0_PWRDN
#define ADC12_CTL0_SCLKDIV          GENMASK(26, 24)

#define ADC12_CTL0_SCLKDIV_VAL_DIV_BY_1  0U
#define ADC12_CTL0_SCLKDIV_VAL_DIV_BY_2  FIELD_PREP(ADC12_CTL0_SCLKDIV, 1)
#define ADC12_CTL0_SCLKDIV_VAL_DIV_BY_4  FIELD_PREP(ADC12_CTL0_SCLKDIV, 2)
#define ADC12_CTL0_SCLKDIV_VAL_DIV_BY_8  FIELD_PREP(ADC12_CTL0_SCLKDIV, 3)
#define ADC12_CTL0_SCLKDIV_VAL_DIV_BY_16 FIELD_PREP(ADC12_CTL0_SCLKDIV, 4)
#define ADC12_CTL0_SCLKDIV_VAL_DIV_BY_24 FIELD_PREP(ADC12_CTL0_SCLKDIV, 5)
#define ADC12_CTL0_SCLKDIV_VAL_DIV_BY_32 FIELD_PREP(ADC12_CTL0_SCLKDIV, 6)
#define ADC12_CTL0_SCLKDIV_VAL_DIV_BY_48 FIELD_PREP(ADC12_CTL0_SCLKDIV, 7)

/* ctl1 bits */
#define ADC12_CTL1_TRIGSRC              BIT(0)
#define ADC12_CTL1_TRIGSRC_VAL_SOFTWARE 0U
#define ADC12_CTL1_SC                   BIT(8)
#define ADC12_CTL1_CONSEQ               GENMASK(17, 16)
#define ADC12_CTL1_CONSEQ_VAL_SEQUENCE  FIELD_PREP(ADC12_CTL1_CONSEQ, 1)
#define ADC12_CTL1_SAMPMODE             BIT(20)
#define ADC12_CTL1_SAMPMODE_VAL_AUTO    0U
#define ADC12_CTL1_AVGN                 GENMASK(26, 24)
#define ADC12_CTL1_AVGD                 GENMASK(30, 28)

#define ADC12_CTL1_AVGN_VAL_DISABLED 0U
#define ADC12_CTL1_AVGN_VAL_ACC_2    FIELD_PREP(ADC12_CTL1_AVGN, 1)
#define ADC12_CTL1_AVGN_VAL_ACC_4    FIELD_PREP(ADC12_CTL1_AVGN, 2)
#define ADC12_CTL1_AVGN_VAL_ACC_8    FIELD_PREP(ADC12_CTL1_AVGN, 3)
#define ADC12_CTL1_AVGN_VAL_ACC_16   FIELD_PREP(ADC12_CTL1_AVGN, 4)
#define ADC12_CTL1_AVGN_VAL_ACC_32   FIELD_PREP(ADC12_CTL1_AVGN, 5)
#define ADC12_CTL1_AVGN_VAL_ACC_64   FIELD_PREP(ADC12_CTL1_AVGN, 6)
#define ADC12_CTL1_AVGN_VAL_ACC_128  FIELD_PREP(ADC12_CTL1_AVGN, 7)

#define ADC12_CTL1_AVGD_VAL_DIV_BY_1   0U
#define ADC12_CTL1_AVGD_VAL_DIV_BY_2   FIELD_PREP(ADC12_CTL1_AVGD, 1)
#define ADC12_CTL1_AVGD_VAL_DIV_BY_4   FIELD_PREP(ADC12_CTL1_AVGD, 2)
#define ADC12_CTL1_AVGD_VAL_DIV_BY_8   FIELD_PREP(ADC12_CTL1_AVGD, 3)
#define ADC12_CTL1_AVGD_VAL_DIV_BY_16  FIELD_PREP(ADC12_CTL1_AVGD, 4)
#define ADC12_CTL1_AVGD_VAL_DIV_BY_32  FIELD_PREP(ADC12_CTL1_AVGD, 5)
#define ADC12_CTL1_AVGD_VAL_DIV_BY_64  FIELD_PREP(ADC12_CTL1_AVGD, 6)
#define ADC12_CTL1_AVGD_VAL_DIV_BY_128 FIELD_PREP(ADC12_CTL1_AVGD, 7)

/* ctl2 bits */
#define ADC12_CTL2_DF                   BIT(0)
#define ADC12_CTL2_DF_VAL_UNSIGNED      0U
#define ADC12_CTL2_RES                  GENMASK(2, 1)
#define ADC12_CTL2_RES_VAL_12_BIT       0U
#define ADC12_CTL2_RES_VAL_10_BIT       FIELD_PREP(ADC12_CTL2_RES, 1)
#define ADC12_CTL2_RES_VAL_8_BIT        FIELD_PREP(ADC12_CTL2_RES, 2)
#define ADC12_CTL2_STARTADD             GENMASK(20, 16)
#define ADC12_CTL2_STARTADD_VAL_ADDR_00 0U
#define ADC12_CTL2_ENDADD               GENMASK(28, 24)

/* scomp0/scomp1 bits */
#define ADC12_SCOMP_VAL GENMASK(9, 0)

/* memctl bits */
#define ADC12_MEMCTL_CHANSEL             GENMASK(4, 0)
#define ADC12_MEMCTL_VRSEL               GENMASK(10, 8)
#define ADC12_MEMCTL_VRSEL_VAL_VDDA      0U
#define ADC12_MEMCTL_VRSEL_VAL_EXTREF    1U
#define ADC12_MEMCTL_VRSEL_VAL_INTREF    2U
#define ADC12_MEMCTL_STIME               BIT(12)
#define ADC12_MEMCTL_AVGEN               BIT(16)
#define ADC12_MEMCTL_AVGEN_VAL_DISABLE   0U
#define ADC12_MEMCTL_AVGEN_VAL_ENABLE    ADC12_MEMCTL_AVGEN
#define ADC12_MEMCTL_BCSEN_VAL_DISABLE   0U
#define ADC12_MEMCTL_TRIG_VAL_AUTO_NEXT  0U
#define ADC12_MEMCTL_WINCOMP_VAL_DISABLE 0U

/*
 * ADC12 registers have an alias at 0x556000 offset, these registers can be read at MCLK rate
 * instead of ULPCLK which is used with unaliased registers. Subtract 0x1000 since there are no
 * power/clock registers in the aliased region.
 */
#define ADC12_ALIAS_OFFSET 0x555000U

/* cpu_int bits: only the last MEMCTL of a sequence raises MEMRESIFG(n) */
#define ADC12_CPU_INT_MEMRESIFG0_OFS 8U

/* cpu_int.iidx values for a MEMRES result-loaded interrupt */
#define ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG0  9U
#define ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG1  10U
#define ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG2  11U
#define ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG3  12U
#define ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG4  13U
#define ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG5  14U
#define ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG6  15U
#define ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG7  16U
#define ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG8  17U
#define ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG9  18U
#define ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG10 19U
#define ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG11 20U

enum mspm0_oversampling {
	ADC_MSPM0_AVG_DISABLED,
	ADC_MSPM0_AVG_2X,
	ADC_MSPM0_AVG_4X,
	ADC_MSPM0_AVG_8X,
	ADC_MSPM0_AVG_16X,
	ADC_MSPM0_AVG_32X,
	ADC_MSPM0_AVG_64X,
	ADC_MSPM0_AVG_128X
};

struct adc_mspm0_channel_cfg {
	uint8_t vrsel: 2; /* raw ADC12_MEMCTL_VRSEL index: 0=VDDA, 1=EXTREF, 2=INTREF */
	uint8_t stime: 1; /* raw ADC12_MEMCTL_STIME index: 0=SCOMP0, 1=SCOMP1 */
	bool configured: 1;
} __packed;

struct adc_mspm0_data {
	struct adc_context ctx;
	const struct device *dev;
	uint16_t *buffer;
	uint16_t *repeat_buffer;
	uint16_t sample_time[ADC_MSPM0_NUM_SAMPLE_TIMERS];
	struct adc_mspm0_channel_cfg *channel_cfg;
	uint8_t channel_eoc;
#ifdef CONFIG_REGULATOR_MSPM0_VREF
	uint8_t vref_flags;
#endif
};

struct adc_mspm0_cfg {
	struct adc_mspm0_regs *regs;
	const struct pinctrl_dev_config *pinctrl;
	void (*irq_cfg_func)(void);
	const struct device *vref_config;
	const struct mspm0_sys_clock *clock_subsys;
	const uint32_t clkcfg_sampclk;
	uint32_t clock_div_reg;
	const uint8_t divider;
	const uint8_t max_result;
	const uint8_t num_channels;
	bool auto_pwdn;
};

