zephyrproject-rtos/zephyr/drivers/adc/adc_mspm0_adc12.c
static inline uint16_t adc_mspm0_get_mem_result(struct adc_mspm0_regs *regs, uint8_t idx)
{
	volatile struct adc_mspm0_regs *alias_regs =
		(struct adc_mspm0_regs *)((uintptr_t)regs + ADC12_ALIAS_OFFSET);

	return alias_regs->memres[idx];
}

static int adc_mspm0_clkfreq_range(uint32_t sample_clk_hz, uint32_t *frange)
{
	if (sample_clk_hz > 48000000U) {
		return -EINVAL;
	}

	if (sample_clk_hz <= 4000000U) {
		*frange = ADC12_CLKFREQ_FRANGE_VAL_RANGE1TO4;
	} else if (sample_clk_hz <= 8000000U) {
		*frange = ADC12_CLKFREQ_FRANGE_VAL_RANGE4TO8;
	} else if (sample_clk_hz <= 16000000U) {
		*frange = ADC12_CLKFREQ_FRANGE_VAL_RANGE8TO16;
	} else if (sample_clk_hz <= 20000000U) {
		*frange = ADC12_CLKFREQ_FRANGE_VAL_RANGE16TO20;
	} else if (sample_clk_hz <= 24000000U) {
		*frange = ADC12_CLKFREQ_FRANGE_VAL_RANGE20TO24;
	} else if (sample_clk_hz <= 32000000U) {
		*frange = ADC12_CLKFREQ_FRANGE_VAL_RANGE24TO32;
	} else if (sample_clk_hz <= 40000000U) {
		*frange = ADC12_CLKFREQ_FRANGE_VAL_RANGE32TO40;
	} else {
		*frange = ADC12_CLKFREQ_FRANGE_VAL_RANGE40TO48;
	}

	return 0;
}

static void adc_mspm0_isr(const struct device *dev)
{
	struct adc_mspm0_data *data = dev->data;
	const struct adc_mspm0_cfg *config = dev->config;
	struct adc_mspm0_regs *regs = config->regs;
	uint8_t mem_ix;

	switch (regs->cpu_int.iidx) {
	case ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG0:
	case ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG1:
	case ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG2:
	case ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG3:
	case ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG4:
	case ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG5:
	case ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG6:
	case ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG7:
	case ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG8:
	case ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG9:
	case ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG10:
	case ADC12_CPU_INT_IIDX_STAT_VAL_MEMRESIFG11:
		for (mem_ix = 0; mem_ix <= data->channel_eoc; mem_ix++) {
			data->buffer[mem_ix] = adc_mspm0_get_mem_result(regs, mem_ix);
		}
		regs->cpu_int.imask &=
			~((1 << (data->channel_eoc)) << ADC12_CPU_INT_MEMRESIFG0_OFS);
		break;
	default:
		LOG_ERR("unexpected interrupt");
		break;
	}
	adc_context_on_sampling_done(&data->ctx, dev);
}

static void adc_context_start_sampling(struct adc_context *ctx)
{
	struct adc_mspm0_data *data = CONTAINER_OF(ctx, struct adc_mspm0_data, ctx);
	const struct device *dev = data->dev;
	const struct adc_mspm0_cfg *config = dev->config;
	struct adc_mspm0_regs *regs = config->regs;
	uint32_t memresifg = (1 << data->channel_eoc) << ADC12_CPU_INT_MEMRESIFG0_OFS;

	regs->cpu_int.iclr |= memresifg;
	regs->cpu_int.imask |= memresifg;
	regs->ctl0 |= ADC12_CTL0_ENC;
	regs->ctl1 |= ADC12_CTL1_SC;
}

static void adc_context_update_buffer_pointer(struct adc_context *ctx, bool repeat)
{
	struct adc_mspm0_data *data = CONTAINER_OF(ctx, struct adc_mspm0_data, ctx);

	if (repeat) {
		data->buffer = data->repeat_buffer;
	} else {
		data->buffer += data->channel_eoc + 1;
	}
}

static int adc_mspm0_validate_sampling_time(const struct adc_mspm0_cfg *config, uint16_t acq_time)
{
	uint32_t clock_rate;
	uint32_t period_ns;
	int ret;
	uint8_t wakeup_cycles;

	ret = clock_control_get_rate(DEVICE_DT_GET(DT_NODELABEL(ckm)),
				     (struct mspm0_sys_clock *)config->clock_subsys, &clock_rate);
	if (ret < 0) {
		return ret;
	}

	if (!config->auto_pwdn) {
		if (acq_time == ADC_ACQ_TIME_DEFAULT) {
			return 0;
		}

		if ((ADC_ACQ_TIME_UNIT(acq_time) == ADC_ACQ_TIME_TICKS) &&
		    (ADC_ACQ_TIME_VALUE(acq_time) <= ADC12_SCOMP_VAL)) {
			return ADC_ACQ_TIME_VALUE(acq_time);
		} else {
			return -EINVAL;
		}
	} else {
		period_ns = ADC_MSPM0_NS_PER_SEC / (clock_rate / config->divider);
		/* Wakeup time is 5us for both l and g mspm0 series */
		wakeup_cycles = ADC_MSPM0_WAKEUP_TIME_NS / period_ns;

		if (acq_time == ADC_ACQ_TIME_DEFAULT) {
			return wakeup_cycles + 1;
		}

		if (ADC_ACQ_TIME_UNIT(acq_time) != ADC_ACQ_TIME_TICKS) {
			return -EINVAL;
		}

		acq_time = ADC_ACQ_TIME_VALUE(acq_time) + wakeup_cycles;
		if (acq_time > ADC12_SCOMP_VAL) {
			return -EINVAL;
		}
		return acq_time;
	}
}

static int adc_mspm0_channel_setup(const struct device *dev,
				   const struct adc_channel_cfg *channel_cfg)
{
	struct adc_mspm0_data *data = dev->data;
	const struct adc_mspm0_cfg *config = dev->config;
	struct adc_mspm0_regs *regs = config->regs;
	const uint8_t ch = channel_cfg->channel_id;
	int sampling_time;
	int ret = 0;

	if ((ch >= config->num_channels) ||
	    (channel_cfg->differential) ||
	    (channel_cfg->gain != ADC_GAIN_1)) {
		return -EINVAL;
	}

	sampling_time = adc_mspm0_validate_sampling_time(dev->config,
							 channel_cfg->acquisition_time);
	if (sampling_time < 0) {
		return sampling_time;
	}

	adc_context_lock(&data->ctx, false, NULL);

	if (data->sample_time[ADC_MSPM0_SCOMP0] == UINT16_MAX) {
		regs->scomp0 = sampling_time;
		data->sample_time[ADC_MSPM0_SCOMP0] = sampling_time;
		data->channel_cfg[ch].stime = ADC_MSPM0_SCOMP0;
	} else if (data->sample_time[ADC_MSPM0_SCOMP0] == sampling_time) {
		data->channel_cfg[ch].stime = ADC_MSPM0_SCOMP0;
	} else if (data->sample_time[ADC_MSPM0_SCOMP1] == UINT16_MAX) {
		regs->scomp1 = sampling_time;
		data->sample_time[ADC_MSPM0_SCOMP1] = sampling_time;
		data->channel_cfg[ch].stime = ADC_MSPM0_SCOMP1;
	} else if (data->sample_time[ADC_MSPM0_SCOMP1] == sampling_time) {
		data->channel_cfg[ch].stime = ADC_MSPM0_SCOMP1;
	} else {
		ret = -EINVAL;
		goto unlock;
	}

	switch (channel_cfg->reference) {
	case ADC_REF_VDD_1:
		data->channel_cfg[ch].vrsel = ADC12_MEMCTL_VRSEL_VAL_VDDA;
		break;
#ifdef CONFIG_REGULATOR_MSPM0_VREF
	case ADC_REF_INTERNAL:
		data->channel_cfg[ch].vrsel = ADC12_MEMCTL_VRSEL_VAL_INTREF;

		if ((data->vref_flags & EXT_VREF) || !(config->vref_config)) {
			ret = -EINVAL;
			goto unlock;
		}

		if (!(data->vref_flags & INT_VREF)) {
			if (regulator_enable(config->vref_config) < 0) {
				ret = -ENODEV;
				goto unlock;
			}
			data->vref_flags |= INT_VREF;
		}
		break;
	case ADC_REF_EXTERNAL0:
		data->channel_cfg[ch].vrsel = ADC12_MEMCTL_VRSEL_VAL_EXTREF;

		if ((data->vref_flags & INT_VREF) || !(config->vref_config)) {
			ret = -EINVAL;
			goto unlock;
		}

		if (regulator_is_enabled(config->vref_config)) {
			LOG_ERR("Cannot use external vref: regulator is already in use");
			ret = -EBUSY;
			goto unlock;
		}

		if (!(data->vref_flags & EXT_VREF)) {
			data->vref_flags |= EXT_VREF;
		}
		break;
#endif
	default:
		ret = -EINVAL;
		goto unlock;
	}

	data->channel_cfg[ch].configured = true;

unlock:
	adc_context_release(&data->ctx, 0);
	return ret;
}

static int adc_mspm0_config_sequence(const struct device *dev, const struct adc_sequence *seq)
{
	struct adc_mspm0_data *data = dev->data;
	const struct adc_mspm0_cfg *config = dev->config;
	struct adc_mspm0_regs *regs = config->regs;
	uint32_t channels = seq->channels;
	uint32_t resolution;
	uint32_t avg_enabled = 0;
	uint32_t avg_acc = 0;
	uint32_t avg_div = 0;
	uint32_t vrsel;
	uint32_t stime;
	uint8_t mem_ctl_count = 0;
	uint8_t ch;

	switch (seq->resolution) {
	case ADC_MSPM0_RESOLUTION_14:
	case ADC_MSPM0_RESOLUTION_12:
		resolution = ADC12_CTL2_RES_VAL_12_BIT;
		break;
	case ADC_MSPM0_RESOLUTION_10:
		resolution = ADC12_CTL2_RES_VAL_10_BIT;
		break;
	case ADC_MSPM0_RESOLUTION_8:
		resolution = ADC12_CTL2_RES_VAL_8_BIT;
		break;
	default:
		return -EINVAL;
	}

	switch (seq->oversampling) {
	case ADC_MSPM0_AVG_DISABLED:
		avg_enabled = ADC12_MEMCTL_AVGEN_VAL_DISABLE;
		break;
	case ADC_MSPM0_AVG_2X:
		avg_enabled = ADC12_MEMCTL_AVGEN_VAL_ENABLE;
		avg_acc = ADC12_CTL1_AVGN_VAL_ACC_2;
		avg_div = ADC12_CTL1_AVGD_VAL_DIV_BY_2;
		break;
	case ADC_MSPM0_AVG_4X:
		avg_enabled = ADC12_MEMCTL_AVGEN_VAL_ENABLE;
		avg_acc = ADC12_CTL1_AVGN_VAL_ACC_4;
		avg_div = ADC12_CTL1_AVGD_VAL_DIV_BY_4;
		break;
	case ADC_MSPM0_AVG_8X:
		avg_enabled = ADC12_MEMCTL_AVGEN_VAL_ENABLE;
		avg_acc = ADC12_CTL1_AVGN_VAL_ACC_8;
		avg_div = ADC12_CTL1_AVGD_VAL_DIV_BY_8;
		break;
	case ADC_MSPM0_AVG_16X:
		avg_enabled = ADC12_MEMCTL_AVGEN_VAL_ENABLE;
		avg_acc = ADC12_CTL1_AVGN_VAL_ACC_16;
		avg_div = ADC12_CTL1_AVGD_VAL_DIV_BY_16;
		break;
	case ADC_MSPM0_AVG_32X:
		avg_enabled = ADC12_MEMCTL_AVGEN_VAL_ENABLE;
		avg_acc = ADC12_CTL1_AVGN_VAL_ACC_32;
		avg_div = ADC12_CTL1_AVGD_VAL_DIV_BY_32;
		break;
	case ADC_MSPM0_AVG_64X:
		avg_enabled = ADC12_MEMCTL_AVGEN_VAL_ENABLE;
		avg_acc = ADC12_CTL1_AVGN_VAL_ACC_64;
		avg_div = ADC12_CTL1_AVGD_VAL_DIV_BY_64;
		break;
	case ADC_MSPM0_AVG_128X:
		avg_enabled = ADC12_MEMCTL_AVGEN_VAL_ENABLE;
		avg_acc = ADC12_CTL1_AVGN_VAL_ACC_128;
		if (seq->resolution == 14) {
			avg_div = ADC12_CTL1_AVGD_VAL_DIV_BY_32;
		} else {
			avg_div = ADC12_CTL1_AVGD_VAL_DIV_BY_128;
		}
		break;
	default:
		return -EINVAL;
	}

	while (channels) {
		ch = find_lsb_set(channels) - 1;
		if ((ch >= config->num_channels) || !data->channel_cfg[ch].configured) {
			return -EINVAL;
		}

		vrsel = FIELD_PREP(ADC12_MEMCTL_VRSEL, data->channel_cfg[ch].vrsel);
		stime = FIELD_PREP(ADC12_MEMCTL_STIME, data->channel_cfg[ch].stime);

