zephyrproject-rtos/zephyr/drivers/adc/adc_mspm0_adc12.c
		if (mem_ctl_count < config->max_result) {
			regs->memctl[mem_ctl_count] =
				FIELD_PREP(ADC12_MEMCTL_CHANSEL, ch) | vrsel | stime | avg_enabled |
				ADC12_MEMCTL_BCSEN_VAL_DISABLE | ADC12_MEMCTL_TRIG_VAL_AUTO_NEXT |
				ADC12_MEMCTL_WINCOMP_VAL_DISABLE;
		} else {
			return -EINVAL;
		}

		mem_ctl_count++;
		channels &= ~BIT(ch);
	}

	regs->ctl1 = (regs->ctl1 & ~(ADC12_CTL1_AVGN | ADC12_CTL1_AVGD)) | avg_acc | avg_div;

	if (mem_ctl_count - 1 != data->channel_eoc) {
		return -EINVAL;
	}

	regs->ctl1 =
		(regs->ctl1 & ~(ADC12_CTL1_SAMPMODE | ADC12_CTL1_CONSEQ | ADC12_CTL1_TRIGSRC)) |
		ADC12_CTL1_CONSEQ_VAL_SEQUENCE | ADC12_CTL1_SAMPMODE_VAL_AUTO |
		ADC12_CTL1_TRIGSRC_VAL_SOFTWARE;

	regs->ctl2 = (regs->ctl2 &
		      ~(ADC12_CTL2_ENDADD | ADC12_CTL2_STARTADD | ADC12_CTL2_RES | ADC12_CTL2_DF)) |
		     ADC12_CTL2_STARTADD_VAL_ADDR_00 |
		     FIELD_PREP(ADC12_CTL2_ENDADD, data->channel_eoc) | resolution |
		     ADC12_CTL2_DF_VAL_UNSIGNED;

	return 0;
}

static int adc_mspm0_read_internal(const struct device *dev, const struct adc_sequence *sequence)
{
	struct adc_mspm0_data *data = dev->data;
	const struct adc_mspm0_cfg *config = dev->config;
	int sequence_ret;
	uint8_t ch_count = POPCOUNT(sequence->channels);
	size_t exp_size;

	if ((sequence->resolution != ADC_MSPM0_RESOLUTION_14) &&
	    (sequence->resolution != ADC_MSPM0_RESOLUTION_12) &&
	    (sequence->resolution != ADC_MSPM0_RESOLUTION_10) &&
	    (sequence->resolution != ADC_MSPM0_RESOLUTION_8)) {
		return -EINVAL;
	}

	if (sequence->resolution == ADC_MSPM0_RESOLUTION_14 &&
	    sequence->oversampling != ADC_MSPM0_MAX_OVERSAMPLING) {
		return -EINVAL;
	}

	if ((ch_count == 0) || (ch_count > config->max_result) ||
	    (sequence->oversampling > ADC_MSPM0_MAX_OVERSAMPLING)) {
		return -EINVAL;
	}

	if (sequence->calibrate) {
		return -ENOTSUP;
	}

	exp_size = ch_count * sizeof(uint16_t);
	if (sequence->options) {
		exp_size *= (1 + sequence->options->extra_samplings);
	}

	if (sequence->buffer_size < exp_size) {
		return -ENOMEM;
	}

	data->channel_eoc = ch_count - 1;
	data->buffer = sequence->buffer;
	data->repeat_buffer = data->buffer;

	sequence_ret = adc_mspm0_config_sequence(dev, sequence);
	if (sequence_ret < 0) {
		return sequence_ret;
	}

	adc_context_start_read(&data->ctx, sequence);
	return adc_context_wait_for_completion(&data->ctx);
}

static int adc_mspm0_read(const struct device *dev, const struct adc_sequence *sequence)
{
	struct adc_mspm0_data *data = dev->data;
	int ret;

	adc_context_lock(&data->ctx, false, NULL);
	ret = adc_mspm0_read_internal(dev, sequence);
	adc_context_release(&data->ctx, ret);

	return ret;
}

#ifdef CONFIG_ADC_ASYNC
static int adc_mspm0_read_async(const struct device *dev, const struct adc_sequence *sequence,
				struct k_poll_signal *async)
{
	struct adc_mspm0_data *data = dev->data;
	int ret;

	adc_context_lock(&data->ctx, true, async);
	ret = adc_mspm0_read_internal(dev, sequence);
	adc_context_release(&data->ctx, ret);

	return ret;
}
#endif

static int adc_mspm0_init(const struct device *dev)
{
	struct adc_mspm0_data *data = dev->data;
	const struct adc_mspm0_cfg *config = dev->config;
	struct adc_mspm0_regs *regs = config->regs;
	uint32_t clock_rate;
	uint32_t frange;
	int ret;

	data->dev = dev;

	ret = pinctrl_apply_state(config->pinctrl, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		return ret;
	}

	ret = clock_control_get_rate(DEVICE_DT_GET(DT_NODELABEL(ckm)),
				     (struct mspm0_sys_clock *)config->clock_subsys, &clock_rate);
	if (ret < 0) {
		return ret;
	}

	regs->gprcm.pwren =
		FIELD_PREP(ADC12_PWREN_KEY, ADC12_PWREN_KEY_VAL_UNLOCK) | ADC12_PWREN_ENABLE;
	k_busy_wait(k_cyc_to_us_ceil32(CONFIG_MSPM0_PERIPH_STARTUP_DELAY));

	regs->gprcm.clkcfg = (regs->gprcm.clkcfg & ~(ADC12_CLKCFG_KEY | ADC12_CLKCFG_SAMPCLK)) |
			     FIELD_PREP(ADC12_CLKCFG_KEY, ADC12_CLKCFG_KEY_VAL_UNLOCK) |
			     config->clkcfg_sampclk;
	regs->ctl0 = (regs->ctl0 & ~ADC12_CTL0_SCLKDIV) | config->clock_div_reg;

	ret = adc_mspm0_clkfreq_range(clock_rate / config->divider, &frange);
	if (ret < 0) {
		return ret;
	}
	regs->clkfreq = frange;

	if (config->auto_pwdn) {
		regs->ctl0 = (regs->ctl0 & ~ADC12_CTL0_PWRDN) | ADC12_CTL0_PWRDN_VAL_AUTO;
	} else {
		regs->ctl0 = (regs->ctl0 & ~ADC12_CTL0_PWRDN) | ADC12_CTL0_PWRDN_VAL_MANUAL;
	}

	data->sample_time[ADC_MSPM0_SCOMP0] = UINT16_MAX;
	data->sample_time[ADC_MSPM0_SCOMP1] = UINT16_MAX;

	for (int i = 0; i < ADC_MSPM0_CHANNEL_MAX; i++) {
		data->channel_cfg[i].configured = 0;
	}
	config->irq_cfg_func();

	adc_context_unlock_unconditionally(&data->ctx);

	return 0;
}

#define MSPM0_ADC_VREF_MV(index)								   \
	COND_CODE_1(DT_INST_NODE_HAS_PROP(index, vref),						   \
		    (DT_PROP(DT_PHANDLE(DT_DRV_INST(index), vref), regulator_uv) / 1000), (0))	   \

#define MSPM0_ADC_VREF(index) | MSPM0_ADC_VREF_MV(index)

static DEVICE_API(adc, mspm0_driver_api) = {
	.channel_setup = adc_mspm0_channel_setup,
	.read = adc_mspm0_read,
	.ref_internal = (0 DT_INST_FOREACH_STATUS_OKAY(MSPM0_ADC_VREF)),
	IF_ENABLED(CONFIG_ADC_ASYNC, (.read_async = adc_mspm0_read_async,))
};

#define ADC_CLOCK_DIV(x)    DT_INST_PROP(x, ti_clk_divider)
#define ADC_DT_CLOCK_DIV(x) _CONCAT(ADC12_CTL0_SCLKDIV_VAL_DIV_BY_, ADC_CLOCK_DIV(x))

/*
 * CLKCFG.SAMPCLK only accepts ULPCLK/SYSOSC/HFCLK; resolve the DT clock cell
 * (already captured in mspm0_sys_clock.clk) to its 2-bit register value at
 * build time instead of a runtime lookup.
 */
#define ADC_DT_SAMPCLK(x)                                                                          \
	((DT_INST_CLOCKS_CELL(x, clk) == MSPM0_CLOCK_ULPCLK)   ? ADC12_CLKCFG_SAMPCLK_VAL_ULPCLK   \
	 : (DT_INST_CLOCKS_CELL(x, clk) == MSPM0_CLOCK_SYSOSC) ? ADC12_CLKCFG_SAMPCLK_VAL_SYSOSC   \
	 : (DT_INST_CLOCKS_CELL(x, clk) == MSPM0_CLOCK_HFCLK)  ? ADC12_CLKCFG_SAMPCLK_VAL_HFCLK    \
							       : -1)

#define MSPM0_ADC_INIT(index)                                                                      \
                                                                                                   \
	PINCTRL_DT_INST_DEFINE(index);                                                             \
                                                                                                   \
	BUILD_ASSERT(ADC_DT_SAMPCLK(index) != -1,                                                  \
		     "unsupported ADC sample clock source: must be ULPCLK, SYSOSC or HFCLK");      \
                                                                                                   \
	BUILD_ASSERT(DT_INST_PROP(index, ti_num_channels) <= ADC_MSPM0_CHANNEL_MAX,                \
		     "unsupported number of channels, ADC can only support max 32 channels");      \
                                                                                                   \
	static void adc_mspm0_cfg_func_##index(void)                                               \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQN(index), DT_INST_IRQ(index, priority), adc_mspm0_isr,      \
			    DEVICE_DT_INST_GET(index), 0);                                         \
		irq_enable(DT_INST_IRQN(index));                                                   \
	}											   \
	static const struct mspm0_sys_clock mspm0_adc_sys_clock##index =                           \
						MSPM0_CLOCK_SUBSYS_FN(index);			   \
                                                                                                   \
	struct adc_mspm0_channel_cfg								   \
		adc_mspm0_channel_cfg_##index[DT_INST_PROP(index, ti_num_channels)];               \
                                                                                                   \
	static const struct adc_mspm0_cfg adc_mspm0_cfg_##index = {                                \
		.regs = (struct adc_mspm0_regs *)DT_INST_REG_ADDR(index),                          \
		.irq_cfg_func = adc_mspm0_cfg_func_##index,                                        \
		.pinctrl = PINCTRL_DT_INST_DEV_CONFIG_GET(index),                                  \
		.clock_subsys = &mspm0_adc_sys_clock##index,                                       \
		.divider = ADC_CLOCK_DIV(index),                                                   \
		.clkcfg_sampclk = ADC_DT_SAMPCLK(index),                                           \
		.clock_div_reg = ADC_DT_CLOCK_DIV(index),                                          \
		.max_result = DT_INST_PROP(index, max_result_reg),                                 \
		.num_channels = DT_INST_PROP(index, ti_num_channels),                              \
		.auto_pwdn = DT_INST_PROP_OR(index, auto_powerdown, false),                        \
		COND_CODE_1(DT_INST_NODE_HAS_PROP(index, vref),					   \
		(.vref_config = DEVICE_DT_GET(DT_PHANDLE(DT_DRV_INST(index), vref)),),		   \
		(.vref_config = NULL)) };							   \
	static struct adc_mspm0_data adc_mspm0_data_##index = {                                    \
		ADC_CONTEXT_INIT_TIMER(adc_mspm0_data_##index, ctx),                               \
		ADC_CONTEXT_INIT_LOCK(adc_mspm0_data_##index, ctx),                                \
		ADC_CONTEXT_INIT_SYNC(adc_mspm0_data_##index, ctx),                                \
		.channel_cfg = adc_mspm0_channel_cfg_##index,                                      \
	};                                                                                         \
	DEVICE_DT_INST_DEFINE(index, &adc_mspm0_init, NULL, &adc_mspm0_data_##index,               \
			      &adc_mspm0_cfg_##index, POST_KERNEL, CONFIG_ADC_INIT_PRIORITY,       \
			      &mspm0_driver_api);						   \

DT_INST_FOREACH_STATUS_OKAY(MSPM0_ADC_INIT)
